[{"id":"22823325","title":"Jordanian Foreign Minister: Iran attacked Jordan, which had prevented the use of its territory and airspace in any attack against it.","category":"cat11","time":"2 minutes agosource","link":""},{"id":"22823324","title":"Israeli Channel 14: Rocket fragments fell on a residential building in the Sharon region of central Israel, with no injuries reported.","category":"cat1","time":"4 minutes agosource","link":""},{"id":"22823323","title":"A source familiar with the matter told Reuters that Qatar was targeted by as many as 44 missiles and 8 drones during today's Iranian attacks.","category":"cat1","time":"10 minutes agosource","link":""},{"id":"22823321","title":"CBS, citing US officials: We used unidirectional attack drones in the attack on Iran","category":"cat10","time":"14 minutes agosource","link":""},{"id":"22823320","title":"Large number of aircrafts are currently going into Iran from the border areas with Iraqi Kurdistan - local sources","category":"cat10","time":"15 minutes agosource","link":""},{"id":"22823319","title":"Iran Red Crescent spokesperson says 24 provinces were targeted by Israeli and US strikes with at least 201 killed and 747 wounded","category":"cat1","time":"16 minutes agosource","link":""},{"id":"22823322","title":"Al-Arabiya TV correspondent: Air defenses activated on Iran's Kish Island","category":"cat10","time":"18 minutes agosource","link":""},{"id":"22823318","title":"Photo from the U.S. Fifth Fleet / CENTCOM headquarters in Bahrain shows damage after three Shahed drones reportedly struck the area","category":"cat1","time":"21 minutes agosource","link":""},{"id":"22823316","title":"US President Donald Trump monitored developments overnight surrounding US and Israeli airstrikes on Iran at Mar-a-Lago with members of his national security team, White House press secretary Karoline Leavitt said on X on Friday","category":"cat10","time":"24 minutes agosource","link":""},{"id":"22823315","title":"Iranian missile being intercepted in the skies over the Tel Aviv","category":"cat10","time":"25 minutes agosource","link":""},{"id":"22823314","title":"The U.S. Department of Transportation is urging commercial vessels to stay away from the Strait of Hormuz, the Persian Gulf, the Gulf of Oman, and the Arabian Sea.","category":"cat10","time":"27 minutes agosource","link":""},{"id":"22823313","title":"Financial Times, quoting the UK Maritime Trade Operations: The Strait of Hormuz remains open, but we advise crossing it with caution.","category":"cat2","time":"27 minutes agosource","link":""},{"id":"22823311","title":"Israeli army: Warning to those present at the C Industrial Complex in Isfahan, as shown on the map: The Defense Forces will attack military infrastructure in the area within the next few minutes. Dear Iranian citizens, you must stay away from the complex. All residents of Maz'ah village must immediately enter their homes and not leave until morning. For your safety, do not approach the C Industrial Complex in Isfahan after it is targeted.","category":"cat10","time":"28 minutes agosource","link":""},{"id":"22823310","title":"Two sources told Reuters: Egypt halts gas imports from Israel","category":"cat11","time":"36 minutes agosource","link":""},{"id":"22823309","title":"Iran launches new barrage of missiles toward Israel","category":"cat1","time":"40 minutes agosource","link":""},{"id":"22823308","title":"Erdogan: I condemn the attacks on Iran's sovereignty","category":"cat7","time":"42 minutes agosource","link":""},{"id":"22823306","title":"US-Israeli aircraft launch extensive airstrikes on Iran","category":"cat10","time":"an hour agosource","link":""},{"id":"22823307","title":"An Israeli-U.S. airstrike targeted hit Zanjan, northwestern Iran. Secondary explosions indicate the likelihood of a missile site","category":"cat10","time":"an hour agosource","link":""},{"id":"22823304","title":"Israeli military: Largest air strike in air force history completed","category":"cat10","time":"an hour agosource","link":""},{"id":"22823305","title":"New interceptions reported over Abu Dhabi amid incoming Iranian missiles/drones","category":"cat6","time":"an hour agosource","link":""},{"id":"22823301","title":"Iran's Revolutionary Guard: The Strait of Hormuz is \"dangerous\" and \"de facto closed.\"","category":"cat1","time":"an hour agosource","link":""},{"id":"22823302","title":"Iraqi Army: Two airstrikes targeted the Jurf al-Sakhr area south of Baghdad for the second time today.","category":"cat10","time":"an hour agosource","link":""},{"id":"22823299","title":"Kuwaiti Army: Three members of the armed forces sustained minor injuries as a result of missile and drone attacks on Ali Al Salem Air Base","category":"cat11","time":"an hour agosource","link":""},{"id":"22823303","title":"Faytuks Network video showing an Iranian drone hitting a building in Bahrain","category":"cat1","time":"an hour agosource","link":""},{"id":"22823300","title":"Dubai Airports suspends all flights Dubai Airports confirms the suspension of all flights at Dubai International Airport (DXB) and Dubai World Central – Al Maktoum International Airport (DWC) until further notice. Passengers are advised not to go to the airport at this time and to contact their airlines for the latest updates regarding their flights.","category":"cat6","time":"an hour agosource","link":""},{"id":"22823298","title":"Iran's message to the United Nations: All American and Israeli bases, facilities, and assets in the region are legitimate targets.","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823297","title":"Iranian media: Explosions heard in Karaj, west of the capital Tehran","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823296","title":"UKMTO has received multiple reports from Company Security Officers of vessels operating in the Arabian Gulf stating that the Strait of Hormuz has been closed.  This has been transmitted to them through VHF broadcasts","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823295","title":"Large explosions reported in Tehran","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823294","title":"Iranian media reported hearing the sound of an explosion in Isfahan","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823293","title":"Rocket Alerts in central Israel","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823291","title":"Bahraini air defenses are intercepting several Iranian missiles over Manama","category":"cat11","time":"2 hours agosource","link":""},{"id":"22823289","title":"Sirens, interceptors up over Haifa","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823290","title":"The UAE Ministry of Defense: The Iranian attacks are a blatant violation of national sovereignty and international law, and we reserve the full right to take all necessary measures to protect the country's territory and citizens.","category":"cat6","time":"2 hours agosource","link":""},{"id":"22823288","title":"Iran is apparently targeting areas near the Burj Khalifa, with kamikaze drones approaching the building","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823287","title":"IRGC linked forces have carried out an attack on a power plant in Hawler (Erbil) region. Most likely a drone launched by the PMF (Hashd Al Shaabi). Power outages are being reported across the autonomous region of Kurdistan - primarily in Duhok and Hawler (Erbil)","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823284","title":"Dubai Media Office: Civil Defense teams brought a fire under control in a building in the Palm Jumeirah area, and four injuries resulted from the incident.","category":"cat6","time":"2 hours agosource","link":""},{"id":"22823283","title":"Qatar's Ministry of Interior: We urge citizens, residents, and visitors not to go out except for extreme necessity until the danger has passed.","category":"cat7","time":"2 hours agosource","link":""},{"id":"22823282","title":"The number of female student dead in Minab, southern Iran, has risen to 85, with dozens injured.","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823281","title":"Reuters: Ships receive high-frequency broadcasts from Iran's Revolutionary Guard saying no ships are allowed to pass through the Strait of Hormuz","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823277","title":"AFP, citing witnesses: Explosion in Palm Jumeirah, Dubai","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823276","title":"Interceptions over Tel Aviv","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823279","title":"It appears that Iran may have struck Dubai with a Shahed kamikaze drone","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823292","title":"Israeli Prime Minister Benjamin Netanyahu had a phone conversation with US President @realDonaldTrump","category":"cat10","time":"2 hours agosource","link":""},{"id":"22823278","title":"Iranian news agency: Iran launches Sejjil missile at  targets","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823280","title":"Iran's Revolutionary Guards have told vessels through VHF transmission that 'no ship is allowed to pass the Strait of Hormuz' - Reuters","category":"cat1","time":"2 hours agosource","link":""},{"id":"22823275","title":"Interception of Irainian missiles over Dubai skies","category":"cat6","time":"3 hours agosource","link":""},{"id":"22823286","title":"Iran has officially requested an urgent extraordinary meeting of the IAEA Board of Governors. The request cites \"baseless claims and illegal actions\" by the US and Israel against Iran's nuclear facilities that require immediate consideration","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823274","title":"The international airport in Kuwait was damaged as a result of Iranian missile attack","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823273","title":"Iran strikes the @FairmontHotels in Dubai, UAE","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823272","title":"Area on Fire in Dubai are Air Defense Failed and fell on the city","category":"cat1","time":"3 hours agosource","link":""},{"id":"22823285","title":"Explosions heard in Shiraz, southern Iran, following airstrikes","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823270","title":"Many explosions and interceptions in the skies over Tel Aviv","category":"cat10","time":"3 hours agosource","link":""},{"id":"22823269","title":"Guterres: The use of force by the US and Israel and the Iranian response undermine international peace and security.","category":"cat5","time":"3 hours agosource","link":""},{"id":"22823268","title":"Airstrikes on targets around Shiraz, several explosions heard","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823266","title":"The IRGC says a U.S. Military Sealift Command (MST) combat support vessel was severely hit by missiles fired by its naval forces. It added that other U.S. naval assets will remain within range of IRGC missiles and drones as attacks continue","category":"cat1","time":"4 hours agosource","link":""},{"id":"22823264","title":"Israeli military: We completed a large-scale strike against the Iranian regime's strategic defense systems.","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823263","title":"France, Germany, and Britain: We call for a resumption of negotiations and a negotiated solution.","category":"cat2","time":"4 hours agosource","link":""},{"id":"22823260","title":"Sirens are sounding again in Tel Aviv","category":"cat1","time":"4 hours agosource","link":""},{"id":"22823261","title":"China calls for an \"immediate halt\" to the escalation with Iran","category":"cat9","time":"4 hours agosource","link":""},{"id":"22823259","title":"Saudi Arabia: Our forces intercepted Iranian missile attacks on Riyadh and the Eastern Province; these attacks cannot be justified under any pretext.","category":"cat11","time":"4 hours agosource","link":""},{"id":"22823262","title":"The U.S. Embassy urges American citizens to leave Lebanon","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823258","title":"Israeli Channel 12, citing an Israeli source: Our assessment is growing that Khamenei has been killed.","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823257","title":"A Daraa 24 correspondent reported that an Iranian missile fell on the road between the town of Nafaa and the village of Ain Dhakar in the Yarmouk Basin area of western Daraa countryside, after being intercepted by Israeli air defenses. He added that an explosion was heard in the town of Al-Shajara, and initial reports indicate that a missile had also fallen.","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823256","title":"A Qatari Defense Ministry official told Al Jazeera that no injuries were reported and the extent of material damage was being assessed following the targeting of a radar in northern Qatar.","category":"cat7","time":"4 hours agosource","link":""},{"id":"22823255","title":"Reuters, citing security sources: US air defenses intercepted and shot down a drone over a US military base near Erbil airport","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823254","title":"UAE air defenses are attempting to intercept missiles launched from Iran towards US bases.","category":"cat6","time":"4 hours agosource","link":""},{"id":"22823253","title":"Al-Arabiya TV correspondent: New missile interception sounds heard in the skies over Doha","category":"cat7","time":"4 hours agosource","link":""},{"id":"22823252","title":"Huge blasts in Bushehr since the past hour","category":"cat10","time":"4 hours agosource","link":""},{"id":"22823250","title":"Emergency Alert in Abu Dhabi, the capital of the United Arab Emirates","category":"cat6","time":"5 hours agosource","link":""},{"id":"22823251","title":"A very loud bang was heard in Abu Dhabi, according to a Reuters witness, as regional tensions continue to escalate","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823249","title":"A new launch of ballistic missiles from Iran has been detected by the Israeli army. Sirens are expected to sound in northern Israel shortly","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823247","title":"Emirates News Agency: The UAE President received a call from the Saudi Crown Prince during which they discussed developments in the region.","category":"cat6","time":"5 hours agosource","link":""},{"id":"22823246","title":"The advisor to the commander-in-chief of the Revolutionary Guard, addressing Trump: Today we launched missiles from old stockpiles, and soon we will unveil weapons you have never seen before.","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823245","title":"Halash website reported that a base and complex affiliated with the Revolutionary Guards in Chabahar were targeted.","category":"cat10","time":"5 hours agosource","link":""},{"id":"22823242","title":"Dubai: Explosion heard","category":"cat6","time":"5 hours agosource","link":""},{"id":"22823265","title":"Turkish Presidency says Turkey doesn't permit the use of its airspace in attacks on Iran. \"Turkey does not permit the use of any of its air, land, or sea elements—including its airspace—for operational purposes in any conflict or war in which it is not a party,\"","category":"cat7","time":"5 hours agosource","link":""},{"id":"22823243","title":"US official tells that the war began with simultaneous US and Israeli strikes, with initial Israeli targets focused on leadership, and the US focused on military infrastructure. \"This is just the start.\"","category":"cat10","time":"5 hours agosource","link":""},{"id":"22823241","title":"A video has been released showing an attack on an IRGC military base in the city of Sanandaj.","category":"cat10","time":"5 hours agosource","link":""},{"id":"22823238","title":"Temporary and partial closure of UAE airspace as an exceptional precautionary measure","category":"cat6","time":"5 hours agosource","link":""},{"id":"22823235","title":"Omani Foreign Ministry: We warn of the danger of the conflict escalating to undesirable consequences in the region.","category":"cat11","time":"5 hours agosource","link":""},{"id":"22823233","title":"A senior Iranian official told Al Jazeera: Targeting our political leaders will not go unanswered, and all political targets are now within the scope of our response.","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823231","title":"Airstrike on Marand Industrial City, East Azerbaijan province @~ 12:00 local time (0830Z) It was targeted during the 12-days war, too","category":"cat10","time":"5 hours agosource","link":""},{"id":"22823230","title":"Israeli army: Air defenses are not completely secure, therefore adherence to the Home Front Command is necessary.","category":"cat10","time":"5 hours agosource","link":""},{"id":"22823229","title":"Israeli Air Force tanker over Syria dragging F-16s to conduct airstrikes on Iran","category":"cat10","time":"5 hours agosource","link":""},{"id":"22823227","title":"Lebanese Foreign Ministry: We condemn the Iranian attacks on the sovereignty of Saudi Arabia, the UAE, Bahrain, Qatar, and Jordan","category":"cat11","time":"5 hours agosource","link":""},{"id":"22823226","title":"UAE Ministry of Defense announces successful interception of new wave of missiles launched from Iran","category":"cat6","time":"5 hours agosource","link":""},{"id":"22823225","title":"AFP: New explosions heard in Dubai","category":"cat6","time":"5 hours agosource","link":""},{"id":"22823228","title":"Reuters witness: Smoke rising from a site on the western edge of Doha","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823232","title":"Kuwaiti Army announces interception of \"ballistic missiles\" targeting airbase","category":"cat11","time":"5 hours agosource","link":""},{"id":"22823267","title":"Iranian Shahed-136 kamikaze drone directly strikes a military asset inside the US Naval Base in Bahrain","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823236","title":"Kuwaiti Army: Ali Al Salem Air Base targeted by several ballistic missiles","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823244","title":"New aerial interceptions in Kuwait's skies","category":"cat11","time":"5 hours agosource","link":""},{"id":"22823234","title":"Iranian Foreign Minister: Netanyahu and Trump's war on Iran is wholly unprovoked, illegal, and illegitimate. Trump has turned 'America First' into 'Israel First'—which always means 'America Last'. Our Powerful Armed Forces are prepared for this day and will teach the aggressors the lesson they deserve","category":"cat1","time":"5 hours agosource","link":""},{"id":"22823223","title":"Israel has declared a nationwide state of emergency, closing schools and workplaces and banning public gatherings amid warnings of Iranian missile and drone attacks. Tens of thousands of reservists are being called up, and hospital patients are being moved to underground facilities. Police have urged people to avoid non-essential travel.","category":"cat10","time":"6 hours agosource","link":""},{"id":"22823220","title":"Sirens are sounding again in Bahrain, with emergency alerts appearing on mobile phones","category":"cat11","time":"6 hours agosource","link":""},{"id":"22823219","title":"Channel 12: The first phase of strikes on Iran will last 4 days.","category":"cat10","time":"6 hours agosource","link":""},{"id":"22823240","title":"Pakistan has temporarily halted its air operations in Afghanistan while ground ops still continue. Decision taken in light of heavy air activity in Iran next door and is meant to avoid any aerial accidents. Pakistani air ops will resume soon","category":"cat7","time":"6 hours agosource","link":""},{"id":"22823218","title":"Israel's Energy Minister orders temporary shutdown of parts of the country's natural gas fields","category":"cat10","time":"6 hours agosource","link":""},{"id":"22823217","title":"Iranian attacks continue against the US base in Al-Jafr, Bahrain","category":"cat1","time":"6 hours agosource","link":""}]
